FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
    #if ( ipconfigIS_ENABLED( niEMAC_AUTO_NEGOTIATION ) )
        /* TODO: xPhyStartAutoNegotiation always returns 0, Should return -1 if xPhyGetMask == 0 ? */
        ( void ) xPhyStartAutoNegotiation( pxPhyObject, xPhyGetMask( pxPhyObject ) );
        xMACConfig.DuplexMode = ( pxPhyObject->xPhyProperties.ucDuplex == PHY_DUPLEX_FULL ) ? ETH_FULLDUPLEX_MODE : ETH_HALFDUPLEX_MODE;
        xMACConfig.Speed = ( pxPhyObject->xPhyProperties.ucSpeed == PHY_SPEED_10 ) ? ETH_SPEED_10M : ETH_SPEED_100M;
    #else
        pxPhyObject->xPhyPreferences.ucSpeed = ipconfigIS_ENABLED( niEMAC_USE_100MB ) ? PHY_SPEED_100 : PHY_SPEED_10;
        pxPhyObject->xPhyPreferences.ucDuplex = ipconfigIS_ENABLED( niEMAC_USE_FULL_DUPLEX ) ? PHY_DUPLEX_FULL : PHY_DUPLEX_HALF;
        /* ucMDI_X unused */
        /* TODO: xPhyFixedValue always return 0 */
        ( void ) xPhyFixedValue( pxPhyObject, xPhyGetMask( pxPhyObject ) );
        xMACConfig.DuplexMode = pxPhyObject->xPhyPreferences.ucDuplex;
        xMACConfig.Speed = pxPhyObject->xPhyPreferences.ucSpeed;
    #endif

    if( HAL_ETH_SetMACConfig( pxEthHandle, &xMACConfig ) == HAL_OK )
    {
        xResult = pdTRUE;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

/* Compute the CRC32 of the given MAC address as per IEEE 802.3 CRC32 */
static uint32_t prvComputeCRC32_MAC( const uint8_t * pucMAC )
{
    uint32_t ulCRC32 = 0xFFFFFFFF;

    for( UBaseType_t i = 0; i < 6; ++i )
    {
        ulCRC32 ^= ( uint32_t ) pucMAC[ i ];

        for( UBaseType_t j = 0; j < 8; ++j )
        {
            ulCRC32 >>= 1;
            if( ulCRC32 & 1 )
            {
                /* IEEE 802.3 CRC32 polynomial - 0x04C11DB7 */
                ulCRC32 ^= __RBIT( 0x04C11DB7 );
            }
        }
    }

    ulCRC32 = ~( ulCRC32 );
    return ulCRC32;
}

/*---------------------------------------------------------------------------*/

/* Compute the hash value of a given MAC address to index the bits in the Hash Table */
static uint32_t prvComputeEthernet_MACHash( const uint8_t * pucMAC )
{
    /* Calculate the 32-bit CRC for the MAC */
    const uint32_t ulCRC32 = prvComputeCRC32_MAC( pucMAC );

    /* Perform bitwise reversal on the CRC32 */
    const uint32_t ulHash = __RBIT( ulCRC32 );

    /* Take the upper 6 bits of the above result */
    return ( ulHash >> 26 );
}

/*---------------------------------------------------------------------------*/

/* Update the Hash Table Registers with hash value of the given MAC address */
static void prvSetMAC_HashFilter( ETH_HandleTypeDef * pxEthHandle, const uint8_t * pucMAC )
{
    static uint32_t ulHashTable[ 2 ];

    const uint32_t ulHash = prvComputeEthernet_MACHash( pucMAC );

    /* Use the upper or lower Hash Table Registers
     * to set the required bit based on the ulHash */
    if( ulHash < 32 )
    {
        ulHashTable[ 0 ] = ulHash;
    }
    else
    {
        ulHashTable[ 1 ] = ulHash;
    }

    ( void ) HAL_ETH_SetHashTable( pxEthHandle, ulHashTable );
}

/*---------------------------------------------------------------------------*/

static void prvMACAddressConfig( ETH_HandleTypeDef * pxEthHandle, uint8_t * pucAddr )
{
    /* ETH_MAC_ADDRESS0 reserved for the primary MAC-address. */
    static UBaseType_t uxMACEntry = ETH_MAC_ADDRESS1;

    switch( uxMACEntry )
    {
        case ETH_MAC_ADDRESS1:
            ( void ) HAL_ETH_SetSourceMACAddrMatch( pxEthHandle, uxMACEntry, pucAddr );
            uxMACEntry = ETH_MAC_ADDRESS2;
            break;

        case ETH_MAC_ADDRESS2:
            ( void ) HAL_ETH_SetSourceMACAddrMatch( pxEthHandle, uxMACEntry, pucAddr );
            uxMACEntry = ETH_MAC_ADDRESS3;
            break;

        case ETH_MAC_ADDRESS3:
            ( void ) HAL_ETH_SetSourceMACAddrMatch( pxEthHandle, uxMACEntry, pucAddr );
            uxMACEntry = ETH_MAC_ADDRESS0;
            break;

        case ETH_MAC_ADDRESS0:
            prvSetMAC_HashFilter( pxEthHandle, pucAddr );
            break;

        default:
            break;
    }
}

/*===========================================================================*/
/*                              Rx Helpers                                   */
/*===========================================================================*/

#if 0
#if ( defined( STM32F4 ) || defined( STM32F7 ) )
    #define ETH_IP_HEADER_IPV4   ETH_DMAPTPRXDESC_IPV4PR
    #define ETH_IP_HEADER_IPV6   ETH_DMAPTPRXDESC_IPV6PR

    #define ETH_IP_PAYLOAD_UNKNOWN   0x00000000U
    #define ETH_IP_PAYLOAD_UDP       ETH_DMAPTPRXDESC_IPPT_UDP
    #define ETH_IP_PAYLOAD_TCP       ETH_DMAPTPRXDESC_IPPT_TCP
    #define ETH_IP_PAYLOAD_ICMPN     ETH_DMAPTPRXDESC_IPPT_ICMP
#endif

static BaseType_t prvAcceptPayload( ETH_HandleTypeDef * pxEthHandle, const uint8_t * const pucEthernetBuffer )
{
    BaseType_t xResult = pdFALSE;

    #if ( ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS ) )
        const UBaseType_t uxPayloadType = READ_BIT( heth->RxDescList.pRxLastRxDesc, ETH_DMARXNDESCWBF_PT )
        const ProtocolPacket_t * pxProtPacket = ( const ProtocolPacket_t * ) pucEthernetBuffer;
        const IPHeader_t * pxIPHeader = &( pxProtPacket->xTCPPacket.xIPHeader );
        switch( uxPayloadType )
        {
            case ETH_IP_PAYLOAD_UNKNOWN:
            case ETH_IP_PAYLOAD_UDP:
                if( ( xPortHasUdpSocket( xUDPHeader->usDestinationPort ) )
                #if( ipconfigUSE_DNS == 1 ) * DNS is also UDP. *
                    || ( xUDPHeader->usSourcePort == FreeRTOS_ntohs( ipDNS_PORT ) )
                #endif
                #if( ipconfigUSE_LLMNR == 1 ) * LLMNR is also UDP. *
                    || ( xUDPHeader->usDestinationPort == FreeRTOS_ntohs( ipLLMNR_PORT ) )
                #endif
                #if( ipconfigUSE_NBNS == 1 ) * NBNS is also UDP. *
                    || ( xUDPHeader->usDestinationPort == FreeRTOS_ntohs( ipNBNS_PORT ) )
                #endif
                )
                {
                    xResult = pdTRUE;
                }
                else
                {
                    xResult = pdFALSE;
                }
                break;

            case ETH_IP_PAYLOAD_TCP:
            case ETH_IP_PAYLOAD_ICMPN:
            default:
        }
    #endif

    return xResult;
}
#endif

